---
type: ElementIntersectsElementFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementIntersectsElementFilter

`Autodesk.Revit.DB.ElementIntersectsElementFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementIntersectsElementFilter | — | `` |
| Method | GetElement | 2012 | `public Element GetElement ()` |
| Method | PassesFilter | — | `` |